backend/app/controllers/items_controller.rb

  def index
    render json: Item.where(list_id: params[:list_id])
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = $1  [["list_id", 1]]

  def create
    render json: Item.create(item_params)
---
INSERT INTO "items" ("title", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sdf"], ["list_id", 1], ["created_at", "2017-11-12 15:05:16.510630"], ["updated_at", "2017-11-12 15:05:16.510630"]]

  def update
      render json: Item.update(params[:id], item_params)
---
UPDATE "items" SET "detail" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["detail", "asdfdsfdsf"], ["updated_at", "2017-11-12 15:50:50.331220"], ["id", 27]]

  def destroy
    render json: Item.destroy(params[:id])
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 4]]