backend/app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    render json: List.all

INSERT INTO "lists" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Default List"], ["created_at", "2017-11-12 14:58:14.348882"], ["updated_at", "2017-11-12 14:58:14.348882"]]
---
  def create
    render json: List.create(list_params)

UPDATE "lists" SET "title" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["title", "sadfsdf"], ["updated_at", "2017-11-12 15:05:40.835000"], ["id", 1]]
---
  def update
      render json: List.update(params[:id], list_params)

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 6]]
---
  def destroy
    render json: List.destroy(params[:id])